backend/app/controllers/events_controller.rb

  def create
    pp params
    @event = Event.new(
      name: params[:name],
      description: params[:description],
      start_time: Time.parse(params[:start_time]),
      end_time: Time.parse(params[:end_time]),
      date: Date.parse(params[:date]),
      event_type: params[:event_type],
      room: Room.find(params[:room_id]),
      company: params[:company_id].present? ? Company.find(params[:company_id]) : nil
      )
    @event.save!
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("room_id", "date", "start_time", "end_time", "event_type", "description", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)